Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum
The spring constant unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.KGM_RAD
Kilogram meter per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.KGM_DEG
Kilogram meter per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.TONM_RAD
Ton meter per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.TONM_DEG
Ton meter per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.NM_RAD
Newton meter per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.NM_DEG
Newton meter per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.DANM_RAD
daNewton meter per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.DANM_DEG
daNewton meter per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.KNM_RAD
kNewton meter per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.KNM_DEG
kNewton meter per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.LBFIN_RAD
lb inch per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.LBFIN_DEG
lb inch per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.LBFFT_RAD
lb feet per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.LBFFT_DEG
lb feet per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.KIPIN_RAD
kip inch per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.KIPIN_DEG
kip inch per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.KIPFT_RAD
kip feet per rad.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.KIPFT_DEG
kip feet per deg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitEnum.UNKNOWN
unknown unit.